{
  "pages": [
    {
      "text": "Hi, As I told you about in the previous post, My work for this summer will be\nimproving the current equation solvers of sympy. There are basically three\nthing I'll have to do.\nCreate a basic set infrastructure for solvers to return sets.\nRewrite the current solvers to be clean and robust.\nOn the top of 1 and 2 write new solvers and function, they will returning\n   and handling all the solutions of equations like sin(x) == 0 and a general\n   singularity finder.\nYou can look at the details in my\nproposal\nA started working on the sets module in the community bonding period, basically\nwriting a set difference class at this\nPR , I try to get it merged by the\nend of this week.\nSet are a pretty general mathematical constructs, and you can solve a lot of\nhard problems if you could compute general set operations. The whole number\ntheory can be defined in terms of sets. So, computing general set operations,\ne.g, intersection, unions is pretty hard problem too and we should not aim to\ndo all them.  In a meeting with Matthew and Sergey we discussed that it would\n    be better if complete the part 2 first. It will give a general idea about\n    what capabilities of sets we need.  Also some sets problems can be reduced\n    to equations and vice versa.  \nI've started working on the univariate solvers at\nPR.  My aim for this\nweek will be.\nCompleting the rational solvers\nGetting the open PR for the sets merged.", 
      "tags": "sympy,GSoC", 
      "loc": "/blog/week-1-and-week-2.html", 
      "title": "Week 1 and Week 2"
    }, 
    {
      "text": "Hi, I'm Harsh Gupta an undergrad student at IIT Kharagpur, I've been accepted\nthis year for the Google Summer of Code program with Sympy.\nSo, What is a Google Summer of Code?\nGoogle Summer of Code is a program by Google to promote opensource development.\nIn this program Google pays handsome stipends to students to work for various opensource\norganisations. In the application phase the students have to write proposals to\nthe organisations describing the projects they want to do\nand how do they fit for it. If the proposal is accepted the student is provided\nwith a mentor and with the guidance of the mentor the student has to complete\nthe project in the given timeline. You can look at my\nproposal.\nI proposed to work on improving the current equation solvers in\nSympy. My mentors for the Project are Matthew Rocklin\nand Sergey B Kipirchev.\nA word about Sympy.\nSympy is a pure python library for symbolic computation. Symbolic\ncomputation is similar to the maths you do by hands and it differs from\nnumerical computations. More about Symbolic and Numerical computation in\nsome other post. Sympy has been created by hundreds of contributors starting from 2006.\nIt has an awesome developer\ncommunity and we encourage outsiders to contribute and get their hands dirty with\nthe code. What do you need to start contributing? Some python skills and little\npatience. Download the latest development code.\nGo through the development workflow.\nFind something to work on from the\nEasyToFix Issues.\nCode it and send us a pull request. Happy Coding.\nI'll give a brief about the project aim and current state of work in the next post.\nI'm looking forward for a great summer with Sympy.", 
      "tags": "", 
      "loc": "/blog/gsoc-2014-with-sympy.html", 
      "title": "GSoC 2014 with Sympy"
    }, 
    {
      "text": "Write your post here.", 
      "tags": "", 
      "loc": "/blog/blah.html", 
      "title": "Blah"
    }
  ]
}